TOKEN = "5474885668:AAGqe8hzXs4TyDifhWkgFu4vYQ7dQolClsQ"

TRIP_STRIDE = 5

MESSAGES = {
  "WELCOME": "Привет! Я - Бот, показывающий расписания рейсов пригородных поездов.",
  "WELCOME_BACK": "Снова привет. Готов к поискам рейсов %s -> %s.",

  "CITY_SELECTED": "Выбран пункт %s.",
  "CITY_INVALID": "Пункт %s не найден. Попробуй ещё раз.",

  "CITIES_NOT_SELECTED": "Вы не выбрали пункт отправления или пункт прибытия.",

  "ASK_FOR_SOURCE": "Напиши название пункта, из которого ты отправляешься.",
  "ASK_FOR_DESTINATION": "Теперь напиши название пункта, в который ты отправляешься.",

  "NO_TRIPS": "Рейсов не найдено.",
  "NO_MORE_TRIPS": "Больше рейсов нет.",

  "SWAPPED": "Пункты поменяны местами (%s -> %s)."
}

REPLIES = {
  "SELECT_SOURCE": "Выбрать пункт отправления",
  "SELECT_DESTINATION": "Выбрать пункт назначения",

  "SEARCH": "Поиск",
  "SEARCH_MORE": "Ещё",

  "START": "Начать",
  "EXIT": "Выход",

  "SWAP": "Поменять пункты местами"
}

CITY_ALIASES = {
  "мск": "Москва",
  "аминьевка": "Аминьевская",
  "киевка": "Москва, Киевский вокзал",
  "питер": "Санкт-Петербург",
  "109 км": "109 Километр",
  "савеловский вокзал": "Москва (Савёловский вокзал)"
}
